outputs/qwen36-35b-a3b-fp8_pro5000_8x72g_input-4k-output-1k_cand32_baseline/results/c008/bench_c32_20260830-222617.log
$ python -m sglang.bench_serving --backend sglang --dataset-name random-ids --random-range-ratio 1.0 --host 127.0.0.1 --port 30001 --model /data/autotune/models/Qwen3.6-35B-A3B-FP8 --dataset-path '' --max-concurrency 32 --random-input-len 4096 --random-output-len 1024 --output-file /workspace/outputs/c008/bench_c32_20260830-222617.jsonl --num-prompts 128
# exit code: 0

----- stdout -----
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=30001, ready_check_timeout_sec=60, dataset_name='random-ids', dataset_path='', dataset_offset=0, agentic_max_turns=None, speed_bench_category=None, speed_bench_output_len=512, model='/data/autotune/models/Qwen3.6-35B-A3B-FP8', served_model_name=None, tokenizer=None, num_prompts=128, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=4096, random_output_len=1024, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=32, output_file='/workspace/outputs/c008/bench_c32_20260830-222617.jsonl', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Waiting up to 60s for http://127.0.0.1:30001/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=30001, ready_check_timeout_sec=60, dataset_name='random-ids', dataset_path='', dataset_offset=0, agentic_max_turns=None, speed_bench_category=None, speed_bench_output_len=512, model='/data/autotune/models/Qwen3.6-35B-A3B-FP8', served_model_name=None, tokenizer=None, num_prompts=128, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=4096, random_output_len=1024, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=32, output_file='/workspace/outputs/c008/bench_c32_20260830-222617.jsonl', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

#Input tokens: 524288
#Output tokens: 131072
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 32        
Successful requests:                     128       
Benchmark duration (s):                  82.37     
Total input tokens:                      524288    
Total input text tokens:                 524288    
Total generated tokens:                  131072    
Total generated tokens (retokenized):    128163    
Request throughput (req/s):              1.55      
Input token throughput (tok/s):          6365.14   
Output token throughput (tok/s):         1591.28   
Peak output token throughput (tok/s):    2144.00   
Peak concurrent requests:                64        
Total token throughput (tok/s):          7956.42   
Concurrency:                             31.98     
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   20581.95  
Median E2E Latency (ms):                 20609.80  
P90 E2E Latency (ms):                    21157.83  
P95 E2E Latency (ms):                    21158.58  
P99 E2E Latency (ms):                    21159.90  
---------------Time to First Token----------------
Mean TTFT (ms):                          2756.13   
Median TTFT (ms):                        2726.38   
P90 TTFT (ms):                           4243.31   
P95 TTFT (ms):                           4293.15   
P99 TTFT (ms):                           4322.06   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          17.43     
Median TPOT (ms):                        17.50     
P90 TPOT (ms):                           19.21     
P95 TPOT (ms):                           19.47     
P99 TPOT (ms):                           19.92     
---------------Inter-Token Latency----------------
Mean ITL (ms):                           17.56     
Median ITL (ms):                         16.01     
P90 ITL (ms):                            16.77     
P95 ITL (ms):                            16.91     
P99 ITL (ms):                            17.11     
Max ITL (ms):                            3947.91   
==================================================

----- stderr -----
/sgl-workspace/sglang/python/sglang/bench_serving.py:13: FutureWarning: `sglang.bench_serving` is deprecated and will be removed in a future release; use `sglang.benchmark.serving` instead (e.g. `python -m sglang.benchmark.serving`).
  warnings.warn(

  0%|          | 0/128 [00:00<?, ?it/s]
  1%|          | 1/128 [00:20<43:32, 20.57s/it]
 26%|██▌       | 33/128 [00:41<01:41,  1.07s/it]
 51%|█████     | 65/128 [01:01<00:51,  1.23it/s]
 76%|███████▌  | 97/128 [01:22<00:23,  1.35it/s]
100%|██████████| 128/128 [01:22<00:00,  1.55it/s]